using System.Collections;
using System.Collections.Generic;
using UnityEngine;

/// <summary>
/// 攻撃のアクションの名前
/// 55-20=35+1=36 + 6=42
/// </summary>
public enum ActionType
{
    None,
    //武器以外はアクションなし
    自然の一撃,
    樹木の突進,
    月光の斬撃,
    白銀の剣舞,
    聖なる大槌の一撃,
    聖なる雷撃,
    //動物のアクション
    ひっかく,
    かみつく,
    かみくだく,
    体当たり,
    跳びかかる,
    角突き,
    翼でうつ,
    毒針,
    頭突き,
    するどい牙,
    電撃,
    毒霧,
    砂塵,
    音波攻撃,
    糸を吐く,
    踏みつける,
    尻尾を振り付ける,
    突進,
    じならし,
    蹴る,
    石を投げる,
    舌で舐める,
    ツノでつく,
    泥かけ,
    突撃,
    吹き飛ばし,
    薙ぎ払い,
    咆哮,
    竜の息吹,
    昼寝,
    癒しの息吹,
    ヒールアタック,
    毒牙,
    コットンガード,
    驚かせる,
    切り裂く,
    唾液の風,
    
}





